; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-3-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-7 - location
	p1-4 - location
	p1-5 - location
	p4-0 - location
	p4-5 - location
	p5-0 - location
	p5-7 - location
	p6-2 - location
	p7-2 - location
	p7-8 - location
	p7-9 - location
	p8-3 - location
	p8-4 - location
	p8-6 - location
	p9-1 - location
	p9-6 - location
	)
	(:init
	(at driver1 s8)
	(at driver2 s9)
	(at driver3 s4)
	(at driver4 s3)
	(at truck1 s9)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at package1 s4)
	(at package2 s3)
	(at package3 s3)
	(at package4 s1)
	(at package5 s3)
	(at package6 s6)
	(at package7 s3)
	(at package8 s7)
	(at package9 s4)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(= (time-to-walk s0 p0-7) 95)
	(= (time-to-walk p0-7 s0) 95)
	(= (time-to-walk s7 p0-7) 63)
	(= (time-to-walk p0-7 s7) 63)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 98)
	(= (time-to-walk p1-4 s1) 98)
	(= (time-to-walk s4 p1-4) 13)
	(= (time-to-walk p1-4 s4) 13)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 8)
	(= (time-to-walk p1-5 s1) 8)
	(= (time-to-walk s5 p1-5) 9)
	(= (time-to-walk p1-5 s5) 9)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 96)
	(= (time-to-walk p4-0 s4) 96)
	(= (time-to-walk s0 p4-0) 40)
	(= (time-to-walk p4-0 s0) 40)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 26)
	(= (time-to-walk p4-5 s4) 26)
	(= (time-to-walk s5 p4-5) 36)
	(= (time-to-walk p4-5 s5) 36)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 75)
	(= (time-to-walk p5-0 s5) 75)
	(= (time-to-walk s0 p5-0) 33)
	(= (time-to-walk p5-0 s0) 33)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(= (time-to-walk s5 p5-7) 77)
	(= (time-to-walk p5-7 s5) 77)
	(= (time-to-walk s7 p5-7) 95)
	(= (time-to-walk p5-7 s7) 95)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 30)
	(= (time-to-walk p6-2 s6) 30)
	(= (time-to-walk s2 p6-2) 13)
	(= (time-to-walk p6-2 s2) 13)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(= (time-to-walk s7 p7-2) 33)
	(= (time-to-walk p7-2 s7) 33)
	(= (time-to-walk s2 p7-2) 24)
	(= (time-to-walk p7-2 s2) 24)
	(path s7 p7-8)
	(path p7-8 s7)
	(path s8 p7-8)
	(path p7-8 s8)
	(= (time-to-walk s7 p7-8) 73)
	(= (time-to-walk p7-8 s7) 73)
	(= (time-to-walk s8 p7-8) 3)
	(= (time-to-walk p7-8 s8) 3)
	(path s7 p7-9)
	(path p7-9 s7)
	(path s9 p7-9)
	(path p7-9 s9)
	(= (time-to-walk s7 p7-9) 65)
	(= (time-to-walk p7-9 s7) 65)
	(= (time-to-walk s9 p7-9) 43)
	(= (time-to-walk p7-9 s9) 43)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(= (time-to-walk s8 p8-3) 42)
	(= (time-to-walk p8-3 s8) 42)
	(= (time-to-walk s3 p8-3) 46)
	(= (time-to-walk p8-3 s3) 46)
	(path s8 p8-4)
	(path p8-4 s8)
	(path s4 p8-4)
	(path p8-4 s4)
	(= (time-to-walk s8 p8-4) 23)
	(= (time-to-walk p8-4 s8) 23)
	(= (time-to-walk s4 p8-4) 16)
	(= (time-to-walk p8-4 s4) 16)
	(path s8 p8-6)
	(path p8-6 s8)
	(path s6 p8-6)
	(path p8-6 s6)
	(= (time-to-walk s8 p8-6) 23)
	(= (time-to-walk p8-6 s8) 23)
	(= (time-to-walk s6 p8-6) 47)
	(= (time-to-walk p8-6 s6) 47)
	(path s9 p9-1)
	(path p9-1 s9)
	(path s1 p9-1)
	(path p9-1 s1)
	(= (time-to-walk s9 p9-1) 62)
	(= (time-to-walk p9-1 s9) 62)
	(= (time-to-walk s1 p9-1) 50)
	(= (time-to-walk p9-1 s1) 50)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(= (time-to-walk s9 p9-6) 57)
	(= (time-to-walk p9-6 s9) 57)
	(= (time-to-walk s6 p9-6) 56)
	(= (time-to-walk p9-6 s6) 56)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 12)
	(= (time-to-drive s2 s0) 12)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 54)
	(= (time-to-drive s6 s0) 54)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 69)
	(= (time-to-drive s8 s0) 69)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 20)
	(= (time-to-drive s3 s1) 20)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 63)
	(= (time-to-drive s4 s1) 63)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 65)
	(= (time-to-drive s6 s1) 65)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 59)
	(= (time-to-drive s1 s2) 59)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 88)
	(= (time-to-drive s3 s2) 88)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 100)
	(= (time-to-drive s4 s2) 100)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 34)
	(= (time-to-drive s0 s3) 34)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 21)
	(= (time-to-drive s5 s3) 21)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 76)
	(= (time-to-drive s7 s3) 76)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 28)
	(= (time-to-drive s8 s3) 28)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 51)
	(= (time-to-drive s3 s4) 51)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 89)
	(= (time-to-drive s5 s4) 89)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 61)
	(= (time-to-drive s6 s4) 61)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 74)
	(= (time-to-drive s0 s5) 74)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 62)
	(= (time-to-drive s3 s6) 62)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 64)
	(= (time-to-drive s5 s6) 64)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 39)
	(= (time-to-drive s8 s6) 39)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 4)
	(= (time-to-drive s9 s7) 4)
	(link s8 s4)
	(link s4 s8)
	(= (time-to-drive s8 s4) 5)
	(= (time-to-drive s4 s8) 5)
	(link s9 s0)
	(link s0 s9)
	(= (time-to-drive s9 s0) 85)
	(= (time-to-drive s0 s9) 85)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 27)
	(= (time-to-drive s2 s9) 27)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 20)
	(= (time-to-drive s3 s9) 20)
	(link s9 s4)
	(link s4 s9)
	(= (time-to-drive s9 s4) 8)
	(= (time-to-drive s4 s9) 8)
	(link s9 s5)
	(link s5 s9)
	(= (time-to-drive s9 s5) 73)
	(= (time-to-drive s5 s9) 73)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 82)
	(= (time-to-drive s8 s9) 82)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s2)
	(at driver3 s0)
	(at driver4 s1)
	(at truck1 s4)
	(at truck2 s8)
	(at package1 s1)
	(at package2 s1)
	(at package3 s0)
	(at package4 s9)
	(at package5 s9)
	(at package6 s4)
	(at package7 s8)
	(at package8 s7)
	(at package9 s2)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 2  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver3 truck2 s4)
   deleted: (at driver3 s4) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 1 of 14
2. (load-truck package1 truck2 s4)
   deleted: (at package1 s4)
   added: (in package1 truck2)
   goals met: 1 of 14
3. (drive-truck truck2 s4 s1 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (driven) from 0 to 63
   goals met: 1 of 14
4. (load-truck package4 truck2 s1)
   deleted: (at package4 s1)
   added: (in package4 truck2)
   goals met: 1 of 14
5. (load-truck package2 truck3 s3)
   deleted: (at package2 s3)
   added: (in package2 truck3)
   goals met: 1 of 14
6. (drive-truck truck2 s1 s3 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (driven) from 63 to 83
   goals met: 1 of 14
7. (board-truck driver4 truck3 s3)
   deleted: (at driver4 s3) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 1 of 14
8. (drive-truck truck3 s3 s1 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   changed: (driven) from 83 to 103
   goals met: 1 of 14
9. (board-truck driver2 truck1 s9)
   deleted: (at driver2 s9) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 1 of 14
10. (disembark-truck driver4 truck3 s1)
   deleted: (driving driver4 truck3)
   added: (at driver4 s1) (empty truck3)
   goals met: 2 of 14
11. (drive-truck truck1 s9 s4 driver2)
   deleted: (at truck1 s9)
   added: (at truck1 s4)
   changed: (driven) from 103 to 111
   goals met: 3 of 14
12. (unload-truck package2 truck3 s1)
   deleted: (in package2 truck3)
   added: (at package2 s1)
   goals met: 4 of 14
13. (load-truck package3 truck2 s3)
   deleted: (at package3 s3)
   added: (in package3 truck2)
   goals met: 4 of 14
14. (drive-truck truck2 s3 s0 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (driven) from 111 to 145
   goals met: 4 of 14
15. (load-truck package9 truck1 s4)
   deleted: (at package9 s4)
   added: (in package9 truck1)
   goals met: 4 of 14
16. (unload-truck package3 truck2 s0)
   deleted: (in package3 truck2)
   added: (at package3 s0)
   goals met: 5 of 14
17. (drive-truck truck2 s0 s3 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (driven) from 145 to 179
   goals met: 5 of 14
18. (load-truck package5 truck2 s3)
   deleted: (at package5 s3)
   added: (in package5 truck2)
   goals met: 5 of 14
19. (load-truck package7 truck2 s3)
   deleted: (at package7 s3)
   added: (in package7 truck2)
   goals met: 5 of 14
20. (drive-truck truck2 s3 s0 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (driven) from 179 to 213
   goals met: 5 of 14
21. (drive-truck truck1 s4 s2 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (driven) from 213 to 313
   goals met: 4 of 14
22. (unload-truck package9 truck1 s2)
   deleted: (in package9 truck1)
   added: (at package9 s2)
   goals met: 5 of 14
23. (drive-truck truck2 s0 s8 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s8)
   changed: (driven) from 313 to 382
   goals met: 6 of 14
24. (unload-truck package7 truck2 s8)
   deleted: (in package7 truck2)
   added: (at package7 s8)
   goals met: 7 of 14
25. (drive-truck truck2 s8 s6 driver3)
   deleted: (at truck2 s8)
   added: (at truck2 s6)
   changed: (driven) from 382 to 421
   goals met: 6 of 14
26. (load-truck package6 truck2 s6)
   deleted: (at package6 s6)
   added: (in package6 truck2)
   goals met: 6 of 14
27. (drive-truck truck2 s6 s8 driver3)
   deleted: (at truck2 s6)
   added: (at truck2 s8)
   changed: (driven) from 421 to 460
   goals met: 7 of 14
28. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 8 of 14
29. (drive-truck truck2 s8 s9 driver3)
   deleted: (at truck2 s8)
   added: (at truck2 s9)
   changed: (driven) from 460 to 542
   goals met: 7 of 14
30. (unload-truck package4 truck2 s9)
   deleted: (in package4 truck2)
   added: (at package4 s9)
   goals met: 8 of 14
31. (unload-truck package5 truck2 s9)
   deleted: (in package5 truck2)
   added: (at package5 s9)
   goals met: 9 of 14
32. (drive-truck truck2 s9 s8 driver3)
   deleted: (at truck2 s9)
   added: (at truck2 s8)
   changed: (driven) from 542 to 624
   goals met: 10 of 14
33. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 9 of 14
34. (drive-truck truck1 s2 s4 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (driven) from 624 to 724
   goals met: 10 of 14
35. (drive-truck truck2 s8 s4 driver3)
   deleted: (at truck2 s8)
   added: (at truck2 s4)
   changed: (driven) from 724 to 729
   goals met: 9 of 14
36. (drive-truck truck2 s4 s1 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s1)
   changed: (driven) from 729 to 792
   goals met: 9 of 14
37. (drive-truck truck1 s4 s2 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (driven) from 792 to 892
   goals met: 8 of 14
38. (unload-truck package1 truck2 s1)
   deleted: (in package1 truck2)
   added: (at package1 s1)
   goals met: 9 of 14
39. (drive-truck truck2 s1 s4 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   changed: (driven) from 892 to 955
   goals met: 9 of 14
40. (unload-truck package6 truck2 s4)
   deleted: (in package6 truck2)
   added: (at package6 s4)
   goals met: 10 of 14
41. (drive-truck truck1 s2 s4 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (driven) from 955 to 1055
   goals met: 11 of 14
42. (drive-truck truck1 s4 s5 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   changed: (driven) from 1055 to 1144
   goals met: 10 of 14
43. (drive-truck truck2 s4 s8 driver3)
   deleted: (at truck2 s4)
   added: (at truck2 s8)
   changed: (driven) from 1144 to 1149
   goals met: 11 of 14
44. (drive-truck truck2 s8 s0 driver3)
   deleted: (at truck2 s8)
   added: (at truck2 s0)
   changed: (driven) from 1149 to 1218
   goals met: 10 of 14
45. (drive-truck truck1 s5 s0 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   changed: (driven) from 1218 to 1292
   goals met: 10 of 14
46. (drive-truck truck1 s0 s8 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s8)
   changed: (driven) from 1292 to 1361
   goals met: 10 of 14
47. (drive-truck truck2 s0 s8 driver3)
   deleted: (at truck2 s0)
   added: (at truck2 s8)
   changed: (driven) from 1361 to 1430
   goals met: 11 of 14
48. (disembark-truck driver3 truck2 s8)
   deleted: (driving driver3 truck2)
   added: (at driver3 s8) (empty truck2)
   goals met: 11 of 14
49. (drive-truck truck1 s8 s0 driver2)
   deleted: (at truck1 s8)
   added: (at truck1 s0)
   changed: (driven) from 1430 to 1499
   goals met: 11 of 14
50. (drive-truck truck1 s0 s6 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s6)
   changed: (driven) from 1499 to 1553
   goals met: 11 of 14
51. (disembark-truck driver2 truck1 s6)
   deleted: (driving driver2 truck1)
   added: (at driver2 s6) (empty truck1)
   goals met: 11 of 14
52. (walk driver2 s6 p6-2)
   deleted: (at driver2 s6)
   added: (at driver2 p6-2)
   changed: (walked) from 0 to 30
   goals met: 11 of 14
53. (walk driver2 p6-2 s2)
   deleted: (at driver2 p6-2)
   added: (at driver2 s2)
   changed: (walked) from 30 to 43
   goals met: 12 of 14
54. (walk driver3 s8 p8-6)
   deleted: (at driver3 s8)
   added: (at driver3 p8-6)
   changed: (walked) from 43 to 66
   goals met: 12 of 14
55. (walk driver3 p8-6 s6)
   deleted: (at driver3 p8-6)
   added: (at driver3 s6)
   changed: (walked) from 66 to 113
   goals met: 12 of 14
56. (board-truck driver3 truck1 s6)
   deleted: (at driver3 s6) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 12 of 14
57. (drive-truck truck1 s6 s4 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   changed: (driven) from 1553 to 1614
   goals met: 13 of 14
58. (disembark-truck driver3 truck1 s4)
   deleted: (driving driver3 truck1)
   added: (at driver3 s4) (empty truck1)
   goals met: 13 of 14
59. (walk driver3 s4 p4-0)
   deleted: (at driver3 s4)
   added: (at driver3 p4-0)
   changed: (walked) from 113 to 209
   goals met: 13 of 14
60. (walk driver3 p4-0 s0)
   deleted: (at driver3 p4-0)
   added: (at driver3 s0)
   changed: (walked) from 209 to 249
   goals met: 14 of 14
